OpenNuvoton/NUC970_NonOS_BSP/Driver/Source/jpegcodec.c
/**************************************************************************//**
* @file     jpegcodec.c
* @version  V1.00
* $Revision: 3 $
* $Date: 15/06/12 9:00a $
* @brief    NUC970 JPEG driver source file
*
* @note
* Copyright (C) 2015 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "nuc970.h"
#include "sys.h"
#include "jpegcodec.h"
#include "jpeg.h"

/** @addtogroup NUC970_Device_Driver NUC970 Device Driver
  @{
*/

/** @addtogroup NUC970_JPEG_Driver JPEG Driver
  @{
*/

/// @cond HIDDEN_SYMBOLS

BOOL volatile g_bWait = FALSE, g_jpegError = FALSE, g_bScale = FALSE,g_OutputWait = FALSE, g_InputWait = FALSE,g_u32WindowDec = FALSE,g_bEncThumbnailDownScale = FALSE,g_bEncPrimaryDownScale =FALSE;
UINT32 volatile g_u32Stride, g_u32ScaleWidth, g_u32ScaleHeight, g_u32OpMode,g_u32EncRotate = 0;
UINT32 volatile g_u32BufferCount,g_u32DecInputWaitAddr;
UINT16 volatile g_u16BufferSize, g_u16ReserveSize;
UINT32 volatile g_u32OutputFormat,g_u32windowSizeX,g_u32windowSizeY;


PFN_JPEG_CALLBACK pfnJpegDecodeComplete = NULL;
PFN_JPEG_CALLBACK pfnJpegDecodeError = NULL;
PFN_JPEG_CALLBACK pfnJpegEncodeComplete = NULL;
PFN_JPEG_HEADERDECODE_CALLBACK pfnJpegHeaderDecode = NULL;
PFN_JPEG_DECWAIT_CALLBACK pfnJpegDecInputWait = NULL;
PFN_JPEG_DECWAIT_CALLBACK pfnJpegDecOutputWait = NULL;

static JPEG_INFO_T jpegInfo;

/* Default Quantization-Table 0 ~ 2 */
UINT8 g_au8QTable0[64] = { 0x06, 0x04, 0x04, 0x05, 0x04, 0x04, 0x06, 0x05,
                           0x05, 0x05, 0x06, 0x06, 0x06, 0x07, 0x08, 0x0E,
                           0x09, 0x08, 0x08, 0x08, 0x08, 0x11, 0x0C, 0x0D,
                           0x0A, 0x0E, 0x14, 0x11, 0x15, 0x14, 0x13, 0x11,
                           0x13, 0x13, 0x16, 0x18, 0x1F, 0x1A, 0x16, 0x17,
                           0x1D, 0x17, 0x13, 0x13, 0x1B, 0x25, 0x1B, 0x1D,
                           0x20, 0x21, 0x23, 0x23, 0x23, 0x15, 0x1A, 0x26,
                           0x29, 0x26, 0x22, 0x28, 0x1F, 0x22, 0x23, 0x21
                         };
UINT8 g_au8QTable1[64] = { 0x06, 0x06, 0x06, 0x08, 0x07, 0x08, 0x10, 0x09,
                           0x09, 0x10, 0x21, 0x16, 0x13, 0x16, 0x21, 0x21,
                           0x21, 0x21, 0x21, 0x21, 0x21, 0x21, 0x21, 0x21,
                           0x21, 0x21, 0x21, 0x21, 0x21, 0x21, 0x21, 0x21,
                           0x21, 0x21, 0x21, 0x21, 0x21, 0x21, 0x21, 0x21,
                           0x21, 0x21, 0x21, 0x21, 0x21, 0x21, 0x21, 0x21,
                           0x21, 0x21, 0x21, 0x21, 0x21, 0x21, 0x21, 0x21,
                           0x21, 0x21, 0x21, 0x21, 0x21, 0x21, 0x21, 0x21
                         };
UINT8 g_au8QTable2[64] = { 0x03, 0x03, 0x03, 0x03, 0x03, 0x03, 0x03, 0x03,
                           0x03, 0x03, 0x03, 0x03, 0x03, 0x03, 0x03, 0x03,
                           0x03, 0x03, 0x03, 0x03, 0x03, 0x03, 0x03, 0x03,
                           0x03, 0x03, 0x03, 0x03, 0x03, 0x03, 0x03, 0x03,
                           0x03, 0x03, 0x03, 0x03, 0x03, 0x03, 0x03, 0x03,
                           0x03, 0x03, 0x03, 0x03, 0x03, 0x03, 0x03, 0x03,
                           0x03, 0x03, 0x03, 0x03, 0x03, 0x03, 0x03, 0x03,
                           0x03, 0x03, 0x03, 0x03, 0x03, 0x03, 0x03, 0x03
                         };

/* Interrupt Service Routine for H/W JPEG CODEC */
void jpegISR(void)
{
    UINT32 u32interruptStatus;

    /* Get the interrupt status */
    u32interruptStatus = JPEG_GET_INT_STATUS();

    /* It's Header Decode Complete Interrupt */
    if(u32interruptStatus & DHE_INTS)
    {
        UINT32 u32YuvFormat;
        UINT16 u16Height,u16Width,UVHeight,UVWidth;
        UINT16 u16WidthTmp, u16HeightTmp;
        /* Get the JPEG format */
        u32YuvFormat = JPEG_DEC_GET_DECODED_IMAGE_FORMAT();

        /* Get the decoded image dimension */
        jpegGetDecodedDimension(&u16Height,&u16Width);

        jpegInfo.jpeg_width = u16Width;
        jpegInfo.jpeg_height = u16Height;
        jpegInfo.yuvformat = u32YuvFormat;

        if(pfnJpegHeaderDecode!= NULL)
        {
            if(!pfnJpegHeaderDecode())
            {
                jpegInit();
                g_bWait = FALSE;
                return;
            }
        }

        if(g_bScale)
        {
            UINT16 u16RatioH,u16RatioW;

            if(jpegCalScalingFactor(
                        g_u32OpMode,            //Up / Down Scaling
                        u16Height,              //Original Height
                        u16Width,               //Original Width
                        g_u32ScaleHeight,           //Scaled Height
                        g_u32ScaleWidth,            //Scaled Width
                        &u16RatioH,             //Horizontal Ratio
                        &u16RatioW              //Vertical Ratio
                    ) != E_SUCCESS)
            {
                g_bWait = FALSE;
                g_jpegError = TRUE;
            }
            else
            {
                jpegSetScalingFactor(g_u32OpMode,u16RatioH,u16RatioW);
                u16Width =  g_u32ScaleWidth;
                u16Height = g_u32ScaleHeight;
            }
        }
        else
        {

            if(u32YuvFormat == JPEG_DEC_YUV411)
            {
                /* 32-pixel alignment for YUV411 raw data */
                if(u16Width % 32)
                    u16Width = (u16Width & 0xFFFFFFE0) + 32;
            }
            else if((u32YuvFormat == JPEG_DEC_YUV444) || (u32YuvFormat == JPEG_DEC_YUV422T))
            {
                /* 8-pixel alignment for YUV444 raw data */
                if(u16Width % 8)
                    u16Width = (u16Width & 0xFFFFFFF8) + 8;
            }
            else
            {
                /* 16-pixel alignment for YUV422 or YUV420 raw data */
                if(u16Width % 16)
                    u16Width = (u16Width & 0xFFFFFFF0) + 16;
            }
        }

        if(g_u32Stride >= u16Width)
        {
            jpegInfo.stride = g_u32Stride;
            g_u32Stride = g_u32Stride - u16Width;
            JPEG_SET_YSTRIDE(g_u32Stride);
            u16Width = jpegInfo.stride;
        }
        else
        {
            g_u32Stride = 0;
            JPEG_SET_YSTRIDE(0);
            jpegInfo.stride = 0;
        }

        if(g_u32OutputFormat == JPEG_DEC_PRIMARY_PLANAR_YUV || g_u32OutputFormat ==JPEG_DEC_THUMBNAIL_PLANAR_YUV)
        {
            if(g_u32WindowDec)
            {
                u16WidthTmp = u16Width;
                u16HeightTmp = u16Height;

                u16Width = g_u32windowSizeX;
                u16Height = g_u32windowSizeY;
            }

            if(u32YuvFormat == JPEG_DEC_YUV411)
            {
                /* For YUV411 raw data */
                UVWidth = u16Width/4;
            }
            else if((u32YuvFormat == JPEG_DEC_YUV444) || (u32YuvFormat == JPEG_DEC_YUV422T))
            {
                /* For YUV444 raw data */
                UVWidth = u16Width;
            }
            /* Set the U-component and V-componente width for YUV422 or YUV420 raw data */
            else if(u16Width % 2)
                UVWidth = u16Width / 2 + 1;
            else
                UVWidth = u16Width / 2;


            /* Sets the height of U and V for YUV420 image */
            if(u32YuvFormat == JPEG_DEC_YUV420)
            {
                /* 16-pixel alignment for YUV422 or YUV420 raw data */
                if(u16Height % 16)
                    u16Height = (u16Height & 0xFFFFFFF0) + 16;
                UVHeight = u16Height / 2;
            }
            else if(u32YuvFormat == JPEG_DEC_YUV422)
            {
                /* 8-pixel alignment for YUV444 raw data */
                if(u16Height % 8)
                    u16Height = (u16Height & 0xFFFFFFF8) + 8;
                UVHeight = u16Height;
            }
            else if(u32YuvFormat == JPEG_DEC_YUV444)
            {
                /* 8-pixel alignment for YUV444 raw data */
                if(u16Height % 8)
                    u16Height = (u16Height & 0xFFFFFFF8) + 8;
                UVHeight = u16Height;
            }
            else if(u32YuvFormat == JPEG_DEC_YUV411)
            {
                /* 8-pixel alignment for YUV411 raw data */
                if(u16Height % 8)
                    u16Height = (u16Height & 0xFFFFFFF8) + 8;
                UVHeight = u16Height;
            }
            else if(u32YuvFormat == JPEG_DEC_YUV422T)
            {
                /* 16-pixel alignment for YUV422 or YUV420 raw data */
                if(u16Height % 16)
                    u16Height = (u16Height & 0xFFFFFFF0) + 16;
                UVHeight = u16Height / 2;
            }
            else
            {
                /* 8-pixel alignment for raw data */
                if(u16Height % 8)
                    u16Height = (u16Height & 0xFFFFFFF8) + 8;
                UVHeight = u16Height;
            }

