OpenNuvoton/NUC970_NonOS_BSP/Driver/Source/jpegcodec.c
            JPEG_SET_UADDR(JPEG_GET_YADDR() + u16Width * u16Height);
            JPEG_SET_VADDR(JPEG_GET_UADDR() + UVWidth * UVHeight);

            if(u32YuvFormat == JPEG_DEC_GRAY)
                jpegInfo.image_size[0] = u16Width * u16Height;
            else
                jpegInfo.image_size[0] = u16Width * u16Height + 2* UVWidth * UVHeight;

            if(g_u32WindowDec)
            {
                u16Width = u16WidthTmp;
                u16Height = u16HeightTmp;
            }
        }
        else
        {
            if(g_u32WindowDec)
            {
                u16WidthTmp = u16Width;
                u16HeightTmp = u16Height;

                u16Width = g_u32windowSizeX;
                u16Height = g_u32windowSizeY;
            }

            if(jpegInfo.stride)
                jpegInfo.image_size[0] = jpegInfo.stride * u16Height;
            else
                jpegInfo.image_size[0] =  u16Width * u16Height;

            if (g_u32OutputFormat == JPEG_DEC_PRIMARY_PACKET_RGB888)
                jpegInfo.image_size[0] = 4 * jpegInfo.image_size[0];
            else
                jpegInfo.image_size[0] = 2 * jpegInfo.image_size[0];

            if(g_u32WindowDec)
            {
                u16Width = u16WidthTmp;
                u16Height = u16HeightTmp;
            }

        }

        /* Set the image dimension */
        jpegSetDimension(u16Height, u16Width);


        outp32(JITCR, inp32(JITCR) | Dec_Scatter_Gather);

        /* Clear interrupt status */
        JPEG_CLEAR_INT(DHE_INTS);
    }
    /* It's Decode Output Wait Interrupt */
    else if(u32interruptStatus & JPG_DOW_INTS)
    {
        if(pfnJpegDecOutputWait!= NULL)
        {
            pfnJpegDecOutputWait(inp32(JYADDR0) , inp32(JDOWFBS));
        }
        JPEG_CLEAR_INT(JPG_DOW_INTS);

        outp32(JITCR, inp32(JITCR) | Dec_Scatter_Gather);

    }
    /* It's Encode Complete Interrupt */
    else if(u32interruptStatus & ENC_INTS)
    {
        /* Get the Encode Bit stream length */
        jpegInfo.image_size[0] = JPEG_GET_ENC_PRIMARY_BITSTREAM_SIZE();
        jpegInfo.image_size[1] = JPEG_GET_ENC_THUMBNAIL_BITSTREAM_SIZE();
        /* Clear interrupt status */
        JPEG_CLEAR_INT(ENC_INTS);

        g_bWait = FALSE;

        if(pfnJpegEncodeComplete!= NULL)
            pfnJpegEncodeComplete();
    }
    /* It's Decode Complete Interrupt */
    else if(u32interruptStatus &DEC_INTS)
    {
        UINT16 imageWidth,imageHeight;

        /* Get the image dimension */
        jpegGetDimension(&imageHeight,&imageWidth);

        if(g_u32Stride!=0)
        {
            imageWidth = imageWidth - g_u32Stride;
        }

        jpegInfo.width = imageWidth;
        jpegInfo.height = imageHeight;

        /* Clear interrupt status */
        JPEG_CLEAR_INT(DEC_INTS);
        JPEG_CLEAR_INT(JPG_DOW_INTS);

        g_bWait = FALSE;

        if(pfnJpegDecodeComplete!= NULL)
            pfnJpegDecodeComplete();
    }
    /* It's Decode Error Interrupt */
    else if(u32interruptStatus & DER_INTS)
    {
        /* Clear interrupt status */
        JPEG_CLEAR_INT(DER_INTS);

        g_bWait = FALSE;
        g_jpegError = TRUE;

        if(pfnJpegDecodeError!= NULL)
            pfnJpegDecodeError();
    }
    else if (u32interruptStatus & IPW_INTS)
    {
        /* Clear interrupt status */
        JPEG_CLEAR_INT(IPW_INTS);

        JPEG_DEC_RESUME_INPUT_WAIT();

        if(pfnJpegDecInputWait!= NULL)
        {
            if(!pfnJpegDecInputWait((g_u32DecInputWaitAddr + (g_u32BufferCount %2) * g_u16BufferSize),g_u16BufferSize))
            {
                jpegInit();
                g_bWait = FALSE;
                return;
            }
            g_u32BufferCount++;
        }
        else
            while(1);

    }

}

//Poll the interrupt status and get if the interrupt is generated
BOOL jpegPollInt(UINT32 u32Intflag)
{
    if(JPEG_GET_INT_STATUS() & u32Intflag)
        return 1;
    else
        return 0;
}

INT jpegAdjustQTAB(UINT8 u8Mode, UINT8 u8Qadjust, UINT8 u8Qscaling)
{
    UINT32 u32Addr;
    if(u8Mode == JPEG_ENC_PRIMARY)
        u32Addr = REG_JPRIQC;
    else if(u8Mode == JPEG_ENC_THUMBNAIL)
        u32Addr = REG_JTHBQC;
    else
        return E_JPEG_INVALID_PARAM;

    outp32(u32Addr,((u8Qadjust & 0xF) << 4 )| (u8Qscaling & 0xF));
    return E_SUCCESS;
}


UINT32 jpegPower(UINT32 u32Index, UINT32 u32Exp)
{
    if(u32Exp==0)
        return 1;
    else
    {
        UINT32 u32Idx;
        for(u32Idx=1; u32Idx<u32Exp; u32Idx = u32Idx+1)
        {
            u32Index = 2 * u32Index;
        }
    }
    return u32Index;
}


INT jpegSetEncodeMode(UINT8 u8SourceFormat, UINT16 u16JpegFormat)
{
    UINT8 u8Gray = 0;
    switch(u16JpegFormat)
    {
        case JPEG_ENC_PRIMARY_YUV420:
        case JPEG_ENC_PRIMARY_YUV422:
        case JPEG_ENC_THUMBNAIL_YUV420:
        case JPEG_ENC_THUMBNAIL_YUV422:
        case (JPEG_ENC_PRIMARY_YUV420 | JPEG_ENC_THUMBNAIL_YUV420):
        case (JPEG_ENC_PRIMARY_YUV422 | JPEG_ENC_THUMBNAIL_YUV422):
            outp32(REG_JMCR,(inp32(REG_JMCR) & WIN_DEC )| u16JpegFormat);
            u8Gray = 0;
            break;
        case JPEG_ENC_PRIMARY_GRAY:
        case JPEG_ENC_THUMBNAIL_GRAY:
        case (JPEG_ENC_PRIMARY_GRAY | JPEG_ENC_THUMBNAIL_GRAY):
            if(u8SourceFormat == JPEG_ENC_SOURCE_PACKET)
                return E_JPEG_INVALID_PARAM;
            else
            {
                if(u16JpegFormat == (JPEG_ENC_PRIMARY_GRAY | JPEG_ENC_THUMBNAIL_GRAY))
                    outp32(REG_JMCR, 0xB0);
                else
                    outp32(REG_JMCR, 0xA0);
            }
            u8Gray = EY_ONLY;
            break;
        default:
            return E_JPEG_INVALID_PARAM;
    }
    g_u32OpMode = JPEG_ENC_UPSCALE_MODE;

    if(g_bEncPrimaryDownScale)
        g_u32OpMode = JPEG_ENC_PLANAR_PRIMARY_DOWNSCALE_MODE;

    if (g_bEncThumbnailDownScale)
        g_u32OpMode = JPEG_ENC_PLANAR_THUMBNAIL_DOWNSCALE_MODE;

    if(u8SourceFormat == JPEG_ENC_SOURCE_PLANAR)
        outp32(REG_JITCR, (inp32(REG_JITCR) & (0x8 | ROTATE)) | PLANAR_ON | u8Gray);
    else if(u8SourceFormat == JPEG_ENC_SOURCE_PACKET)
        outp32(REG_JITCR, inp32(REG_JITCR) & ~(PLANAR_ON | ROTATE));
    else
        return E_JPEG_INVALID_PARAM;

    return E_SUCCESS;
}

INT jpegSetDecodeMode(UINT32 u32OutputFormat)
{
    switch(u32OutputFormat)
    {
        case JPEG_DEC_PRIMARY_PLANAR_YUV:
        case JPEG_DEC_PRIMARY_PACKET_YUV422:
        case JPEG_DEC_PRIMARY_PACKET_RGB555:
        case JPEG_DEC_PRIMARY_PACKET_RGB555R1:
        case JPEG_DEC_PRIMARY_PACKET_RGB555R2:
        case JPEG_DEC_THUMBNAIL_PLANAR_YUV:
        case JPEG_DEC_THUMBNAIL_PACKET_YUV422:
        case JPEG_DEC_THUMBNAIL_PACKET_RGB555:
        case JPEG_DEC_PRIMARY_PACKET_RGB565:
        case JPEG_DEC_PRIMARY_PACKET_RGB565R1:
        case JPEG_DEC_PRIMARY_PACKET_RGB565R2:
        case JPEG_DEC_PRIMARY_PACKET_RGB888:
            outp32(REG_JITCR, u32OutputFormat);
            outp32(REG_JMCR,inp32(REG_JMCR) & ~ENC_DEC);
            g_u32OpMode = JPEG_DEC_PACKET_DOWNSCALE_MODE;
            g_u32OutputFormat = u32OutputFormat;
            if(u32OutputFormat == JPEG_DEC_PRIMARY_PLANAR_YUV || u32OutputFormat == JPEG_DEC_THUMBNAIL_PLANAR_YUV)
                g_u32OpMode = JPEG_DEC_PLANAR_DOWNSCALE_MODE;
            break;
        default:
            return E_JPEG_INVALID_PARAM;
    }
    return E_SUCCESS;
}

VOID jpegDecodeTrigger(void)
{
    g_bWait = TRUE;
    g_jpegError = FALSE;

    memset(&jpegInfo, 0, sizeof(jpegInfo));

