OpenNuvoton/NUC970_NonOS_BSP/Driver/Source/jpegcodec.c
}

VOID jpegGetScalingFactor(
    UINT8   u8Mode,             //Up / Down Scaling
    PUINT16 pu16FactorH,        //Vertical Scaling Factor
    PUINT16 pu16FactorW         //Horizontal Scaling Factor
)
{
    if(u8Mode == JPEG_DEC_PLANAR_DOWNSCALE_MODE)
    {
        *pu16FactorH = inp32(REG_JPSCALD) & 0x3F;
        *pu16FactorW = (inp32(REG_JPSCALD) >> 8) & 0x1F;
    }
    else
    {
        *pu16FactorH = (inp32(REG_JUPRAT) >> 16) & 0x3FFF;
        *pu16FactorW = inp32(REG_JUPRAT) & 0x3FFF;
    }
}

INT jpegSetWindowDecode(
    UINT16  u16StartMCUX,   //Start X MCU
    UINT16  u16StartMCUY,   //Horizontal Scaling Factor
    UINT16  u16EndMCUX,     //Vertical Scaling Factor
    UINT16  u16EndMCUY,     //Horizontal Scaling Factor
    UINT32  u32Stride       //Decode Output Stride
)
{
    if(u16StartMCUX >= u16EndMCUX || u16StartMCUY >= u16EndMCUY)
        return E_JPEG_INVALID_PARAM;

    outp32(REG_JWINDEC0, u16StartMCUY << 16 | u16StartMCUX);
    outp32(REG_JWINDEC1, u16EndMCUY << 16 | u16EndMCUX);
    outp32(REG_JWINDEC2, u32Stride);
    outp32(REG_JMCR, WIN_DEC);
    sysprintf("\tJWINDEC0 0x%X\n", inp32(REG_JWINDEC0));
    sysprintf("\tJWINDEC1 0x%X\n", inp32(REG_JWINDEC1));
    sysprintf("\tJWINDEC2 0x%X\n", inp32(REG_JWINDEC2));
    return E_SUCCESS;
}

/// @endcond HIDDEN_SYMBOLS


/** @addtogroup NUC970_JPEG_EXPORTED_FUNCTIONS JPEG Exported Functions
  @{
*/

/**
  * @brief    The function is used to config and reset JPEG IP.
  *
  * @return   E_SUCCESS: success
  */
INT jpegOpen(void)
{
    UINT32 u32JPGDiv;
    UINT32 u32JPGSource;
    UINT32  u32HclkHz;

    // 1.Check I/O pins. If I/O pins are used by other IPs, return error code (check PINFUN)
    // 2.Enable IP¡¦s clock
    outp32(REG_CLK_HCLKEN, (inp32(REG_CLK_HCLKEN) | (1 << 29))); // Enable JPEG clock

    //u32HclkHz =   sysGetHCLK1Clock();
    u32HclkHz = sysGetClock(SYS_HCLK234) * 1000000;
    u32JPGSource = u32HclkHz / (((inp32(REG_CLK_DIVCTL3) & 0xf0000000) >> 28) + 1);

    u32JPGDiv = 0;

    if(u32JPGSource > 75000000)
    {
        if(u32JPGSource % 75000000)
        {
            u32JPGDiv = (u32JPGSource / 75000000);
        }
        else
            u32JPGDiv = (u32JPGSource / 75000000) - 1;
    }
    outp32(REG_CLK_DIVCTL3, (inp32(REG_CLK_DIVCTL3) & ~(0xf0000000)) | ((u32JPGDiv & 0xf) << 28));

    sysprintf("jpeg engine is %dHz\n",u32JPGSource / (u32JPGDiv+1));

    // 3.Reset IP
    outp32(REG_SYS_AHBIPRST, (1 << 22));  // JPEG IP Reset
    outp32(REG_SYS_AHBIPRST, 0);
    // 4.Configure IP according to inputted arguments (check CLKSEL)
    sysInstallISR((IRQ_LEVEL_1 | HIGH_LEVEL_SENSITIVE), JPEG_IRQn, (PVOID)jpegISR);
    sysSetLocalInterrupt(ENABLE_IRQ);
    sysEnableInterrupt(JPEG_IRQn);
    // 5.Enable IP I/O pins
    // 6.Return E_SUCCESS to present success
    return E_SUCCESS;
}

/**
  * @brief    The function is used to initial device parameters and register.
  *
  * @return   0
  */
VOID jpegInit(void)
{
    /* Set the default values of the JPEG registers */
    g_bScale = FALSE;
    g_u32Stride = 0;
    g_u32BufferCount = 0;
    g_u16ReserveSize = 0;
    g_u32WindowDec = FALSE;
    g_u32windowSizeX = 0;
    g_u32windowSizeY = 0;
    g_InputWait = FALSE;
    g_bEncThumbnailDownScale = FALSE;
    g_bEncPrimaryDownScale = FALSE;
    g_OutputWait = FALSE;
    g_u32EncRotate = 0;
    pfnJpegHeaderDecode = NULL;
    pfnJpegDecInputWait = NULL;
    pfnJpegDecOutputWait = NULL;
    outp32(REG_JPRIQC, 0x000000F4);
    outp32(REG_JTHBQC, 0x000000F4);
    outp32(REG_JPRST, 0x00000004);
    outp32(REG_JTRST, 0x00000004);
    outp32(REG_JITCR, 0x00000000);
    outp32(REG_JINTCR, 0x00000000);
    outp32(JDOWFBS,0xFFFFFFFF);

    // Disable the Primary Up-scaling & Scaling-down
    outp32(REG_JPSCALU, 0x00000000);
    outp32(REG_JPSCALD, 0x00000000);

    // Reset JUPRAT and JSRCH
    outp32(REG_JUPRAT, 0x00000000);
    outp32(REG_JSRCH, 0x00000FFF);
    //-------------------------------------------

    /* Reset JPEG (JMCR [1]) */
    outp32(REG_JMCR,0x00000002);
    outp32(REG_JMCR,0x00000000);
    outp32(REG_JMACR, 0x00400000);  //Can't use single buffer
}

/**
  * @brief    The function is used to check JPEG engine not busy.
  *
  * @return   TRUE: JPEG engine busy  \n
  *           FALSE: JPEG engine not busy
  */
BOOL jpegIsReady(void)
{
    if (g_bWait == FALSE)
        return TRUE;
    else
        return FALSE;
}

/**
  * @brief    The function is used to get JPEG information.
  *
  * @param[out]   *info: JPEG encode/decode information.
  *
  * @return   0
  */
VOID jpegGetInfo(JPEG_INFO_T *info)
{
    memcpy(info, &jpegInfo, sizeof(JPEG_INFO_T));
}

/**
  * @brief    The function is used to wait JPEG engine, until JPEG engine not busy.
  *
  * @return   E_SUCCESS: JPEG engine encode/decode complete \n
  *           FALSE: JPEG engine error
  */
INT jpegWait(void)
{
    while(1)
    {
        if(g_bWait == FALSE)
            break;
    }

    if(g_jpegError)
        return E_FAIL;

    return E_SUCCESS;
}

/**
  * @brief    The function is used to set JPEG Q Table.
  *
  * @param[in]   puQTable0:  Q Table 0
  * @param[in]   puQTable1:  Q Table 1
  * @param[in]   puQTable2:  Q Table 2
  * @param[in]   u8num: Q Table number
  *
  * @return   E_JPEG_TIMEOUT:  Time-out \n
  *           E_SUCCESS: success
  */
INT jpegSetQTAB(PUINT8 puQTable0, PUINT8 puQTable1, PUINT8 puQTable2, UINT8 u8num)
{
    UINT32 u32value;
    UINT32 u32TimeOut;
    int i;

    u32TimeOut = 0xFFFFFF;
    for(i = 0; i < 64; i=i+4)
    {
        while((inp32(REG_JMCR) & QT_BUSY) & u32TimeOut)
            u32TimeOut--;

        if(!u32TimeOut)
            return E_JPEG_TIMEOUT;

        u32value = puQTable0[i] | (puQTable0[i+1]<<8) | (puQTable0[i+2]<<16) | (puQTable0[i+3]<<24);
        outp32((REG_JQTAB0 + i),u32value);
    }

    u32TimeOut = 0xFFFFFF;
    for(i = 0; i < 64; i=i+4)
    {
        while((inp32(REG_JMCR) & QT_BUSY) & u32TimeOut)
            u32TimeOut--;

        if(!u32TimeOut)
            return E_JPEG_TIMEOUT;

        u32value = puQTable1[i] | (puQTable1[i+1]<<8) | (puQTable1[i+2]<<16) | (puQTable1[i+3]<<24);
        outp32((REG_JQTAB1 + i),u32value);
    }

    if (u8num <3)
        return E_SUCCESS;

