OpenNuvoton/NUC970_NonOS_BSP/Driver/Source/jpegcodec.c
    outp32(JITCR, inp32(JITCR) | 0x8);

    u32TimeOut = 0xFFFFFF;

    for(i = 0; i < 64; i=i+4)
    {
        while((inp32(REG_JMCR) & QT_BUSY) & u32TimeOut)
            u32TimeOut--;

        if(!u32TimeOut)
            return E_JPEG_TIMEOUT;

        u32value = puQTable2[i] | (puQTable2[i+1]<<8) | (puQTable2[i+2]<<16) | (puQTable2[i+3]<<24);
        outp32((REG_JQTAB2 + i),u32value);
    }

    u32TimeOut = 0xFFFFFF;
    while((inp32(REG_JMCR) & QT_BUSY) & u32TimeOut)
        u32TimeOut--;

    if(!u32TimeOut)
        return E_JPEG_TIMEOUT;
    else
        return E_SUCCESS;

}

/**
  * @brief    Support some JPEG driver commands for application.
  *
  * @param[in]    cmd: Command.
  *
  * @param[in]    arg0: Arguments for the command.
  *
  * @param[in]    arg1: Arguments for the command.
  *
  * @return   0
  *
  */
VOID jpegIoctl(UINT32 cmd, UINT32 arg0, UINT32 arg1)
{
    JPEG_WINDOW_DECODE_T *winDecode;
    PUINT32 pu32Tmp;

    switch(cmd)
    {
        case JPEG_IOCTL_SET_YADDR:
            JPEG_SET_YADDR(arg0);
            break;
        case JPEG_IOCTL_SET_UADDR:
            JPEG_SET_UADDR(arg0);
            break;
        case JPEG_IOCTL_SET_VADDR:
            JPEG_SET_VADDR(arg0);
            break;
        case JPEG_IOCTL_SET_YSTRIDE:
            JPEG_SET_YSTRIDE(arg0);
            break;
        case JPEG_IOCTL_SET_USTRIDE:
            JPEG_SET_USTRIDE(arg0);
            break;
        case JPEG_IOCTL_SET_VSTRIDE:
            JPEG_SET_VSTRIDE(arg0);
            break;
        case JPEG_IOCTL_SET_BITSTREAM_ADDR:
            JPEG_SET_BITSTREAM_ADDR(arg0);
            break;
        case JPEG_IOCTL_SET_SOURCE_IMAGE_HEIGHT:
            JPEG_SET_SOURCE_IMAGE_HEIGHT(arg0);
            break;
        case JPEG_IOCTL_ENC_SET_HEADER_CONTROL:
            JPEG_ENC_SET_HEADER_CONTROL(arg0);
            break;
        case JPEG_IOCTL_SET_DEFAULT_QTAB:
            jpegSetQTAB(g_au8QTable0,g_au8QTable1, 0, 2);
            break;
        case JPEG_IOCTL_SET_DECODE_MODE:
            jpegSetDecodeMode(arg0);
            break;
        case JPEG_IOCTL_SET_ENCODE_MODE:
            jpegSetEncodeMode(arg0, arg1);
            break;
        case JPEG_IOCTL_SET_DIMENSION:
            jpegSetDimension(arg0, arg1);
            break;
        case JPEG_IOCTL_ENCODE_TRIGGER:
            jpegEncodeTrigger();
            if(g_u16ReserveSize != 0)
            {
                UINT32 u32Addr = JPEG_GET_BITSTREAM_ADDR();
                outp8(u32Addr + 2,0xFF);
                outp8(u32Addr + 3,0xE0);
                outp8(u32Addr + 4,((g_u16ReserveSize - 4) & 0xFF00) >> 8);
                outp8(u32Addr + 5,(g_u16ReserveSize - 4) & 0xFF);
            }
            break;
        case JPEG_IOCTL_DECODE_TRIGGER:
            jpegDecodeTrigger();
            break;
        case JPEG_IOCTL_WINDOW_DECODE:
            winDecode = (JPEG_WINDOW_DECODE_T *)arg0;
            jpegSetWindowDecode(winDecode->u16StartMCUX, winDecode->u16StartMCUY,
                                winDecode->u16EndMCUX, winDecode->u16EndMCUY, winDecode->u32Stride);
            g_u32WindowDec = TRUE;
            g_u32windowSizeX = winDecode->u32Stride;
            g_u32windowSizeY =16*(winDecode->u16EndMCUY - winDecode->u16StartMCUY+1);

            break;
        case JPEG_IOCTL_SET_DECODE_STRIDE:
            g_u32Stride = arg0;
            break;
        case JPEG_IOCTL_SET_DECODE_DOWNSCALE:
            g_bScale = TRUE;
            g_u32ScaleWidth = arg1;
            g_u32ScaleHeight = arg0;
            break;
        case JPEG_IOCTL_SET_ENCODE_UPSCALE:
            g_bScale = TRUE;
            g_u32ScaleWidth = arg1;
            g_u32ScaleHeight = arg0;
            break;
        case JPEG_IOCTL_SET_HEADERDECODE_CALBACKFUN:
            pfnJpegHeaderDecode =(PFN_JPEG_HEADERDECODE_CALLBACK) arg0;
            break;
        case JPEG_IOCTL_SET_DECINPUTWAIT_CALBACKFUN:
            g_InputWait = TRUE;
            pfnJpegDecInputWait =(PFN_JPEG_DECWAIT_CALLBACK) arg0;
            JPEG_DEC_SET_INPUT_WAIT(((UINT16) arg1 / 2048));
            g_u16BufferSize = arg1 / 2;
            break;
        case JPEG_IOCTL_ADJUST_QTAB:
            jpegAdjustQTAB(arg0,((arg1 & 0xFF00) >> 4) ,(arg1 & 0xFF));
            break;
        case JPEG_IOCTL_ENC_RESERVED_FOR_SOFTWARE:
            if(arg0 > 0)
            {
                UINT32 u32Tmp;

                u32Tmp = arg0 + 4;
                if(u32Tmp % 2)
                    u32Tmp++;
                if((u32Tmp % 4) == 0)
                    u32Tmp+=2;
                if(u32Tmp >= 0xFFFF)
                    u32Tmp = 65534;

                outp32(REG_JPSCALU, inp32(REG_JPSCALU) | A_JUMP);
                outp32(JRESERVE, u32Tmp);
                g_u16ReserveSize = u32Tmp;
            }
            break;
        case JPEG_IOCTL_SET_ENCODE_PRIMARY_RESTART_INTERVAL:
            outp32(REG_JPRST,arg0);
            break;
        case JPEG_IOCTL_SET_ENCODE_THUMBNAIL_RESTART_INTERVAL:
            outp32(REG_JTRST,arg0);
            break;
        case JPEG_IOCTL_GET_ENCODE_PRIMARY_RESTART_INTERVAL:
            pu32Tmp = (PUINT32) arg0;
            *pu32Tmp = inp32(REG_JPRST);
            break;
        case JPEG_IOCTL_GET_ENCODE_THUMBNAIL_RESTART_INTERVAL:
            pu32Tmp = (PUINT32) arg0;
            *pu32Tmp = inp32(REG_JTRST);
            break;

        case JPEG_IOCTL_SET_THUMBNAIL_DIMENSION:
            outp32(REG_JTHBWH,((arg0 & 0x1FFF)<<16) | (arg1 & 0x1FFF) );
            break;
        case JPEG_IOCTL_SET_ENCODE_SW_OFFSET:
            outp32(REG_JOFFSET, arg0);
            break;
        case JPEG_IOCTL_GET_THUMBNAIL_DIMENSION:
            pu32Tmp = (PUINT32) arg0;
            *pu32Tmp = inp32(REG_JTHBWH) >> 16;
            pu32Tmp = (PUINT32) arg1;
            *pu32Tmp = inp32(REG_JTHBWH) & 0x1FFF;
            break;
        case JPEG_IOCTL_GET_ENCODE_SW_OFFSET:
            pu32Tmp = (PUINT32) arg0;
            *pu32Tmp = inp32(REG_JOFFSET);
            break;
        case JPEG_IOCTL_SET_ENCODE_PRIMARY_DOWNSCALE:
            g_bScale = TRUE;
            g_bEncPrimaryDownScale = TRUE;
            g_u32ScaleWidth = arg1;
            g_u32ScaleHeight = arg0;
            break;
        case JPEG_IOCTL_SET_ENCODE_THUMBNAIL_DOWNSCALE:
            g_bScale = TRUE;
            g_bEncThumbnailDownScale = TRUE;
            g_u32ScaleWidth = arg1;
            g_u32ScaleHeight = arg0;
            break;
        case JPEG_IOCTL_SET_ENCODE_PRIMARY_ROTATE_RIGHT:
            g_u32EncRotate = JPEG_IOCTL_SET_ENCODE_PRIMARY_ROTATE_RIGHT;
            outp32(REG_JITCR, (inp32(REG_JITCR) & ~ROTATE) | ROTATE);
            break;
        case JPEG_IOCTL_SET_ENCODE_PRIMARY_ROTATE_LEFT:
            g_u32EncRotate = JPEG_IOCTL_SET_ENCODE_PRIMARY_ROTATE_LEFT;
            outp32(REG_JITCR, (inp32(REG_JITCR) & ~ROTATE) | 0x1000);
            break;
        case JPEG_IOCTL_SET_ENCODE_PRIMARY_ROTATE_NORMAL:
            g_u32EncRotate = 0;
            outp32(REG_JITCR, (inp32(REG_JITCR) & ~ROTATE));
            break;
        case JPEG_IOCTL_SET_DECOUTPUTWAIT_CALBACKFUN:
            pfnJpegDecOutputWait = (PFN_JPEG_DECWAIT_CALLBACK) arg0;
            break;
        case JPEG_IOCTL_SET_DECOUTPUTWAIT:
            outp32(JYADDR0, arg0);
            outp32(JDOWFBS, arg1);
            g_OutputWait = TRUE;
            break;
        case JPEG_IOCTL_GET_DECOUTPUTWAIT_ADDR:
            pu32Tmp = (PUINT32) arg0;
            *pu32Tmp = inp32(JYADDR0);
            break;
        case JPEG_IOCTL_GET_DECOUTPUTWAIT_SIZE:
            pu32Tmp = (PUINT32) arg0;
            *pu32Tmp = inp32(JDOWFBS);
            break;
        case JPEG_IOCTL_SET_DECODE_COMPLETE_CALBACKFUN:
            pfnJpegDecodeComplete = (PFN_JPEG_CALLBACK) arg0;
            break;
        case JPEG_IOCTL_SET_ENCODE_COMPLETE_CALBACKFUN:
            pfnJpegEncodeComplete = (PFN_JPEG_CALLBACK) arg0;
            break;
        case JPEG_IOCTL_SET_DECODE_ERROR_CALBACKFUN:
            pfnJpegDecodeError = (PFN_JPEG_CALLBACK) arg0;
            break;
        default:
            break;
    }
}

/**
  * @brief    JPEG function close.
  *
  * @return   0
  *
  */
VOID jpegClose(void)
{

    /* Reset JPEG (JMCR [1]) */
    outp32(REG_JMCR,0x00000002);
    outp32(REG_JMCR,0x00000000);

    //outp32(REG_AHBCLK, (inp32(REG_AHBCLK) & ~JPG_CKE));

    sysDisableInterrupt(JPEG_IRQn);
}



/*@}*/ /* end of group NUC970_JPEG_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group NUC970_JPEG_Driver */

/*@}*/ /* end of group NUC970_Device_Driver */


/*** (C) COPYRIGHT 2015 Nuvoton Technology Corp. ***/


